# Add Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightTable..::..Add Method
ExportLineweightTable Class See Also
---
Inserts a (key, info) pair into Export line weight table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Add(
	ExportLineweightKey exportLineweightKey,
	ExportLineweightInfo exportLineweightInfo
)
```

Visual Basic
---
```text
Public Sub Add ( _
	exportLineweightKey As ExportLineweightKey, _
	exportLineweightInfo As ExportLineweightInfo _
)
```

Visual C++
---
```text
public:
void Add(
	ExportLineweightKey^ exportLineweightKey,
	ExportLineweightInfo^ exportLineweightInfo
)
```

# ### Parameters
exportLineweightKey
    Type: Autodesk.Revit.DB..::..ExportLineweightKey The export line weight Key to be added.
exportLineweightInfo
    Type: Autodesk.Revit.DB..::..ExportLineweightInfo The export line weight info to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The key already exists in the table. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportLineweightTable Class
Autodesk.Revit.DB Namespace